# task 01 == Розділіть змінну так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та екрануйте всі символи одинарної дужки у тексті
alice_in_wonderland = """
'"Would you tell me, please, which way I ought to go from here?"\n
"That depends a good deal on where you want to get to," said the Cat.\n
"I don\'t much care where --" said Alice.\n"
Then it doesn\'t matter which way you go," said the Cat.\n
"-- so long as I get somewhere," Alice added as an explanation.\n
"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'
"""
# task 03 == Виведіть змінну alice_in_wonderland на друк

print(alice_in_wonderland)
"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?

"""

black_sea = 436402
azov_sea = 37800
total_seas = black_sea + azov_sea
print(f"Загальна площа Чорного і Азовського морів становить {total_seas} км2.")
# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
warehouse_1_2_3 = 375291
warehouse_1_2 = 250449
warehouse_2_3 = 222950
warehouse_1 = warehouse_1_2_3 - warehouse_2_3
warehouse_2 = warehouse_1_2 - warehouse_1
warehouse_3 = warehouse_2_3 - warehouse_2
print(f"На першому складі знаходиться {warehouse_1} товарів. \nНа другому складі знаходиться {warehouse_2} товарів. \nНа третьому складі знаходиться {warehouse_3} товарів.")
if warehouse_1_2_3 == warehouse_1 + warehouse_2 + warehouse_3:
    print("Кількість товарів збігається.")
else:
    print("Кількість товарів не збігається.")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
payment = 1179
months = 18
cost = payment * months
print("Загальна вартість комп\'ютера становить", cost, "грн.")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
print(a, b, c, d, e, f)
# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
big_pizza = 274 * 4
med_pizza = 218 * 2
juice = 35 * 2
cake = 350
water = 21 * 3
total_sum = big_pizza + med_pizza + juice + cake + water
print(f"Загальна вартість замовлення буде становити {total_sum} грн.")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_photo = 232
page_size = 8
page_count = 232 / 8
print(f"Для того щоб вклеїти {total_photo} фотографій потрібно {page_count} сторінок.")
# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
road = 1600
fuel_consumption = road / 100 * 9
fuel_tank = 48
stop_count = fuel_consumption / 48
print(f"Для подорожі від Харкова до Будапешту знадобиться {fuel_consumption} літрів пального. Зупинитись на заправках доведеться, як мінімум, {stop_count} разів.")